app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("posts", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["posts", "hey"], ["created_at", "2020-06-12 08:42:22.255297"], ["updated_at", "2020-06-12 08:42:22.255297"], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save